export default {
  data() {
    return {
      validSignin: true,
      validSignup: true,
      name: '',
      email: '',
      tel: '',
      username: '',
      password: '',
      cardNumber: '',
      timestamp: '',
      step: 1,
      nameRules: [
        v => !!v || 'โปรดระบุ ชื่อนาม-สกุล',
        v => (v && v.length <= 50) || 'ชื่อนาม-สกุล ห้ามเกิน 50 ตัวอักษร'
      ],
      usernameRules: [
        v => !!v || 'โปรดระบุ ชื่อผู้ใช้งาน',
        v => (v && v.length <= 50) || 'ชื่อผู้ใช้งาน ห้ามเกิน 50 ตัวอักษร'
      ],
      passwordRules: [
        v => !!v || 'โปรดระบุ รหัสผ่าน',
        v => (v && v.length >= 8) || 'รหัสผ่าน ต้องมากกว่า 8 ตัวอักษร'
      ],
      cardNumberRules: [
        v => !!v || 'โปรดระบุ รหัสบัตรประจำตัวประชาชน',
        v => (v && v.length >= 15) || 'โปรดระบุ รหัสบัตรประจำตัวประชาชน ให้ครบ 13 หลัก',
        v => (v && v.length <= 15) || 'ห้ามระบุ รหัสบัตรประจำตัวประชาชน เกิน 13 หลัก',
        v => /[0-9]{5}\-[0-9]{7}\-[0-9]{1}/.test(v) || 'โปรดระบุอีเมลให้ถูกต้อง'
      ],
      emailRules: [
        v => !!v || 'โปรดระบุ อีเมล',
        v => /.+@.+/.test(v) || 'โปรดระบุอีเมลให้ถูกต้อง'
      ],
      telRules: [
        v => !!v || 'โปรดระบุ เบอร์โทร',
        v => /^[0](?:[2-9]{1}[0-9]{1}\-[0-9]{3}\-[0-9]{4} ?)$/.test(v) || 'โปรดระบุเบอร์โทรให้ถูกต้อง'
      ]
    }
  }
}
